In [1]:
## 1
 ## A01지역의 2015년도 제품별 평균판매량이 가장 높은 상품 3개는?
 
 ## step1: 변수선언
    # target



## 2

# step1: 변수선언
  #  targetYear = 2015
   # targetRegion: "A01"
# step2: 데이터 필터: (변수선언조건 활용)
# step3: 제품기준 distinct -> (drop_duplicates())
         # or 제품키를 기준으로 그룹바이(count)
    
    
## 3

# step1: 변수선언
    # targetYear = 2015
    # targetTerm: 1~13
# step2: 그룹키(지역) 그룹함수(mean)
# step3: 데이터 필터: (변수선언조건 활용)
# step4: 정렬 and rank
# step5: rank >= targetRank

In [2]:
import pandas as pd
import numpy as np

In [3]:
selloutData = pd.read_csv("../dataset/kopo_channel_seasonality_new.csv")

In [4]:
selloutData

       REGIONID    PRODUCT  YEARWEEK      QTY
0           A60   PRODUCT4    201402     71.0
1           A60  PRODUCT59    201402  22275.0
2           A60  PRODUCT34    201402   4463.0
3           A60  PRODUCT47    201402      0.0
4           A60  PRODUCT56    201402     23.0
...         ...        ...       ...      ...
124653      A10  PRODUCT60    201630    824.0
124654      A10  PRODUCT56    201630    275.0
124655      A10  PRODUCT61    201630      0.0
124656      A10  PRODUCT12    201630  15021.0
124657      A10   PRODUCT1    201630    568.0

[124658 rows x 4 columns]

In [7]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK      int64
QTY         float64
dtype: object

In [25]:
targetYear = 2015
targetRegion = "A01"

## 1번문제
## A01지역의 2015년도 제품별 평균판매량을 구하자

## step1 : A01 지역만 뽑는다

In [28]:
selloutData = selloutData.loc[selloutData.REGIONID == targetRegion]

In [29]:
selloutData

       REGIONID    PRODUCT  YEARWEEK       QTY
47          A01  PRODUCT75    201403   23768.0
48          A01   PRODUCT8    201403     105.0
49          A01  PRODUCT19    201403    1513.0
50          A01  PRODUCT20    201403      59.0
51          A01  PRODUCT47    201403    4436.0
...         ...        ...       ...       ...
122490      A01  PRODUCT12    201632  215174.0
122491      A01   PRODUCT1    201632    1242.0
122492      A01  PRODUCT33    201632   14900.0
122493      A01  PRODUCT14    201632   24566.0
122494      A01  PRODUCT62    201632   16827.0

[3611 rows x 4 columns]

## step2: 2015년도만 뽑는다. 함수 활용

In [71]:
def selectPeriod(inValue):
    outValue = inValue

    if outValue >= 201500 and outValue <= 201599:
        return outValue
    else: return False

In [72]:
selloutData = selloutData.loc[selloutData.YEARWEEK.apply(selectPeriod) != False]

In [73]:
sortKey = ["QTY"]
groupKey = ["PRODUCT"]

In [74]:
selloutData = selloutData.sort_values(sortKey)

In [75]:
newData = selloutData.groupby(groupKey)[sortKey].agg("mean").sort_values(sortKey)

In [76]:
newData.size

23

In [22]:
import pandas as pd

## 2번문제
## 2015년도 1사분기(1~13주) 평균 판매량이 가장 높은 지역 5개를 순서대로 적어보자

In [23]:
selloutData = pd.read_csv("../dataset/kopo_channel_seasonality_new.csv")

In [24]:
selloutData

       REGIONID    PRODUCT  YEARWEEK      QTY
0           A60   PRODUCT4    201402     71.0
1           A60  PRODUCT59    201402  22275.0
2           A60  PRODUCT34    201402   4463.0
3           A60  PRODUCT47    201402      0.0
4           A60  PRODUCT56    201402     23.0
...         ...        ...       ...      ...
124653      A10  PRODUCT60    201630    824.0
124654      A10  PRODUCT56    201630    275.0
124655      A10  PRODUCT61    201630      0.0
124656      A10  PRODUCT12    201630  15021.0
124657      A10   PRODUCT1    201630    568.0

[124658 rows x 4 columns]

### 변수 선언

In [27]:
def selectFirstPeirod(inValue):
    outValue = inValue

    if outValue >= 201501 and outValue <= 201513:
        return outValue
    else: return False

In [28]:
# selloutData.YEARWEEK.apply(selectFirstPeirod)

In [31]:
selloutData.YEARWEEK.apply(selectFirstPeirod)

0         False
1         False
2         False
3         False
4         False
          ...
124653    False
124654    False
124655    False
124656    False
124657    False
Name: YEARWEEK, Length: 124658, dtype: object

In [29]:
selloutData2 = selloutData.loc[selloutData.YEARWEEK.apply(selectFirstPeirod) != False]

In [30]:
selloutData2.loc

      REGIONID    PRODUCT  YEARWEEK       QTY
22005      A47   PRODUCT2    201512       2.0
22006      A47  PRODUCT58    201512    3546.0
22007      A47  PRODUCT59    201512  148781.0
22008      A47  PRODUCT34    201512   29332.0
22009      A48  PRODUCT35    201512    4611.0
...        ...        ...       ...       ...
90063      A25  PRODUCT14    201510       0.0
90064      A25  PRODUCT62    201510     564.0
90065      A25  PRODUCT17    201510     115.0
90066      A28  PRODUCT58    201510     139.0
90067      A28  PRODUCT63    201510     258.0

[10322 rows x 4 columns]

In [83]:
groupKey = ["REGIONID"]
sortKey = ["QTY"]

In [84]:
newData = selloutData.groupby(groupKey)[sortKey].agg("mean").sort_values(sortKey)

In [85]:
newData

                    QTY
REGIONID
A36          563.538462
A59          840.656410
A39          993.890819
A66         1011.230769
A65         1049.952663
...                 ...
A27        28716.201923
A29        29359.717949
A01        40121.414716
A47        52446.076923
A41       154823.096154

[70 rows x 1 columns]

## 4번 생각해볼 문제
## 지역, 상품, 분기별 평균 판매량을 산출하세요 
## 분기는 1 ~ 13, 14 ~ 26, 27 ~ 39, 40 ~ 52로 구분. 53 제외

### step 1 : week 컬럼 추출
### step 2 : 함수 적용. 컬럼값 넣기. ex ) 24인 경우. peirod 2 값 줘서 Period 컬럼에 넣는다.
### step 3 : Period 컬럼으로 groupby
### step 4 : 평균 판매량(QTY.agg[mean]) 구하기

In [5]:
selloutData = selloutData.astype( { "REGIONID":str, 
                                   "PRODUCT":str,
                                    "YEARWEEK":str,
                                    "QTY": float})

### step 1 : week 컬럼 추출

In [6]:
selloutData["WEEK"] = selloutData.YEARWEEK.str[4:]

In [7]:
Data = selloutData.astype( { "REGIONID":str, 
                                   "PRODUCT":str,
                                    "YEARWEEK":str,
                                    "QTY": float,
                                    "WEEK": int})

In [7]:
selloutData.reset_index(drop=True, inplace=True)

In [8]:
Data

       REGIONID    PRODUCT YEARWEEK      QTY  WEEK
0           A60   PRODUCT4   201402     71.0     2
1           A60  PRODUCT59   201402  22275.0     2
2           A60  PRODUCT34   201402   4463.0     2
3           A60  PRODUCT47   201402      0.0     2
4           A60  PRODUCT56   201402     23.0     2
...         ...        ...      ...      ...   ...
124653      A10  PRODUCT60   201630    824.0    30
124654      A10  PRODUCT56   201630    275.0    30
124655      A10  PRODUCT61   201630      0.0    30
124656      A10  PRODUCT12   201630  15021.0    30
124657      A10   PRODUCT1   201630    568.0    30

[124658 rows x 5 columns]

### step 2 : 함수 적용. 컬럼값 넣기. ex ) 24인 경우. peirod 2 값 줘서 Period 컬럼에 넣는다.

### 함수 만들기

In [9]:
selloutData = selloutData.astype( { "REGIONID":str, 
                                   "PRODUCT":str,
                                    "YEARWEEK":str,
                                    "QTY": float,
                                    "WEEK": int})

In [9]:
def Peirod(inValue):
    outValue = inValue

    if inValue >= 1 and inValue <= 13:
        outValue = 1
    elif inValue >= 14 and inValue < 27:
        outValue = 2
    elif inValue >= 27 and inValue < 40:
        outValue = 3
    elif inValue >= 40 and inValue < 53:
        outValue = 4
    else: outValue = 0
    return outValue

In [10]:
Peirod(40)

4

In [12]:
Data["PERIOD"] = Data.loc[ ]    WEEK.apply(Peirod)

In [41]:
groupKey = ["PERIOD"]
sortKey = ["QTY"]

In [42]:
Data2 = Data.loc[Data.PERIOD != 0]

In [43]:
Data2

       REGIONID    PRODUCT YEARWEEK      QTY  WEEK  PERIOD
0           A60   PRODUCT4   201402     71.0     2       1
1           A60  PRODUCT59   201402  22275.0     2       1
2           A60  PRODUCT34   201402   4463.0     2       1
3           A60  PRODUCT47   201402      0.0     2       1
4           A60  PRODUCT56   201402     23.0     2       1
...         ...        ...      ...      ...   ...     ...
124653      A10  PRODUCT60   201630    824.0    30       3
124654      A10  PRODUCT56   201630    275.0    30       3
124655      A10  PRODUCT61   201630      0.0    30       3
124656      A10  PRODUCT12   201630  15021.0    30       3
124657      A10   PRODUCT1   201630    568.0    30       3

[123864 rows x 6 columns]

In [46]:
result = Data2.groupby(groupKey)[sortKey].agg("mean").sort_values(sortKey)

In [47]:
result

                 QTY
PERIOD
1        7635.595621
2        8332.657191
3        9042.678357
4       10713.418640